posts/use-emacs-sql-mode-to-connect-to-database-on-a-docker-image/index.html
<!DOCTYPE html>
<html prefix="
" lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>Rebeja · Use Emacs sql-mode to connect to database on a Docker image </title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link rel="stylesheet" href="http://fonts.googleapis.com/css?family=PT+Sans:400,400italic,700%7CAbril+Fatface">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/fork-awesome@1.1.7/css/fork-awesome.min.css" integrity="sha256-gsmEoJAws/Kd3CjuOQzLie5Q3yshhvmo7YNtBG7aaEY=" crossorigin="anonymous">
<meta content="#5670d4" name="theme-color">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://rebeja.eu/posts/use-emacs-sql-mode-to-connect-to-database-on-a-docker-image/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Petru Rebeja">
<link rel="prev" href="../editing-remote-files-over-ssh-with-emacs-and-tramp-mode/" title="Editing remote files over ssh with Emacs and Tramp mode" type="text/html">
<link rel="next" href="../adding-disqus-comments-to-ghost-blog-on-azure/" title="Adding Disqus comments to Ghost blog on Azure" type="text/html">
</head>
<body class="">
    <a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>
    <div class="hsidebar">
        <div class="container sidebar-sticky">
                <nav id="menu" role="navigation" class="sidebar-nav"><a class="sidebar-nav-item" href="../../index.html" title="Home"><i class="fa fa-home"></i>Home</a>
            <a class="sidebar-nav-item" href="../../archive.html" title="Archive"><i class="fa fa-folder-open"></i>Archive</a>
            <a class="sidebar-nav-item" href="../../categories/index.html" title="Tags"><i class="fa fa-tags"></i>Tags</a>
            <a class="sidebar-nav-item" href="../welcome/" title="About"><i class="fa fa-user"></i>About</a>
            <a class="sidebar-nav-item" href="../../pages/en-ro-dictionary-for-ai" title="EN-RO 4 AI"><i class="fa fa-book"></i>EN-RO 4 AI</a>
            <a class="sidebar-nav-item" href="../../rss.xml" title="RSS"><i class="fa fa-feed"></i>RSS</a>
    
    
    </nav><footer id="footer"><span class="copyright">
              Contents © 2023         <a href="mailto:petru.rebeja@gmail.com">Petru Rebeja</a> - Powered by   <a href="https://www.gnu.org/software/emacs/" rel="nofollow">GNU Emacs</a>  &amp;    <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            </span>
            
            
        </footer>
</div>
    </div>
    <div class="content container" id="content">
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><h1 class="post-title p-name"><a href="." class="u-url">Use Emacs sql-mode to connect to database on a Docker image</a></h1>

    <p class="dateline">
      <i class="fa fa-clock-o"></i> <time class="published dt-published" datetime="2017-06-21T00:00:00+02:00" itemprop="datePublished" title="2017-06-21 00:00">2017-06-21 00:00</time>   |   <i class="fa fa-user"></i> 
         Petru Rebeja
      
      
    </p>
    

    <div class="e-content entry-content" itemprop="articleBody text">
    <p>
While working on a project I had to load and process some resources from a MySQL database. I had a database dump and all I needed was to <code>sudo apt-get install mysql</code> but I decided against it because that would just bloat my OS with software used only once and drain my laptop battery with the service running in the background.
</p>

<p>
Instead, I decided to restore the database on a Docker image for MySQL and query the data using <code>mysql-client</code>.
</p>
<div id="outline-container-org948ac39" class="outline-2">
<h2 id="org948ac39">Install <code>mysql-client</code> locally</h2>
<div class="outline-text-2" id="text-org948ac39">
<p>
This one is simple; just run:
</p>
<div class="highlight"><pre><span></span>  sudo apt-get install mysql-client
</pre></div>
</div>
</div>
<div id="outline-container-orgc641ace" class="outline-2">
<h2 id="orgc641ace">Install Docker on Ubuntu</h2>
<div class="outline-text-2" id="text-orgc641ace">
<p>
The first thing to do is to head to <a href="https://docs.docker.com/engine/installation/linux/ubuntu/#install-docker">Docker documentation</a> for instalation instructions which I've copied here:
</p>
<ul class="org-ul">
<li>
<p>
Install packages to allow <code>apt</code> to use a repository over HTTPS:
</p>
<div class="highlight"><pre><span></span>   sudo apt-get install <span class="se">\</span>
       apt-transport-https <span class="se">\</span>
       ca-certificates <span class="se">\</span>
       curl <span class="se">\</span>
       software-properties-common
</pre></div>
</li>
<li>
<p>
Add the official GPG key for Docker
</p>
<div class="highlight"><pre><span></span>   curl -fsSL https://download.docker.com/linux/ubuntu/gpg <span class="p">|</span> sudo apt-key add -
</pre></div>
</li>
<li>
<p>
Setup the <b>stable</b> repository. Make sure to select the proper architecture; in my case it's <code>amd64</code>
</p>
<div class="highlight"><pre><span></span>   sudo add-apt-repository <span class="se">\</span>
       <span class="s2">"deb [arch=amd64] https://download.docker.com/linux/ubuntu \</span>
<span class="s2">       </span><span class="k">$(</span>lsb_release -cs<span class="k">)</span><span class="s2"> \</span>
<span class="s2">       stable"</span>
</pre></div>
</li>
<li>
<p>
Update the package index
</p>
<div class="highlight"><pre><span></span>   sudo apt-get update
</pre></div>
</li>
<li>
<p>
Install Docker
</p>
<div class="highlight"><pre><span></span>   sudo apt-get install docker-ce
</pre></div>
</li>
</ul>
</div>
</div>
<div id="outline-container-org861a47c" class="outline-2">
<h2 id="org861a47c">Restore MySQL database to a Docker container</h2>
<div class="outline-text-2" id="text-org861a47c">
<ul class="org-ul">
<li>
<p>
Download the Docker image for <code>MySQL</code>
</p>
<div class="highlight"><pre><span></span>   sudo docker pull mysql
</pre></div>
</li>
<li>
<p>
Create an empty database
</p>
<div class="highlight"><pre><span></span>   sudo docker run --name &lt;container-name&gt; -e <span class="nv">MYSQL_ROOT_PASSWORD</span><span class="o">=</span>&lt;password&gt; -e <span class="nv">MYSQL_DATABASE</span><span class="o">=</span>&lt;db-name&gt; -d mysql
</pre></div>
<p>
This will create a new container with an empty database and login <code>root</code>.
</p>
</li>
<li>
<p>
Restore database from dump
</p>
<div class="highlight"><pre><span></span>   sudo docker <span class="nb">exec</span> -i &lt;container-name&gt; mysql -u&lt;user-name&gt; -p&lt;password&gt; --database<span class="o">=</span>&lt;db-name&gt; &lt; &lt;path-to-sql-file&gt;
</pre></div>
<p>
Notes:
</p>
<ol class="org-ol">
<li>Make sure that there is no space between <code>-u</code> and <code>&lt;user-name&gt;</code>, e.g. for user <code>root</code> the option should be <code>-uroot</code>
</li>
<li>The same goes for password - e.g. if password is <code>my-secret</code> then the option should be <code>-pmy-secret</code>
</li>
<li>
<code>path-to-sql-file</code> should point to a file on host OS</li>
</ol>
</li>
</ul>
</div>
</div>
<div id="outline-container-org8a91f98" class="outline-2">
<h2 id="org8a91f98">Connect to MySQL database running on Docker container from Emacs</h2>
<div class="outline-text-2" id="text-org8a91f98">
<ul class="org-ul">
<li>First, start the container <code>sudo docker start &lt;container-name&gt;</code>
</li>
<li>Get the IP Address of the container</li>
<li>Get the container configuration using <code>sudo docker inspect &lt;container-name&gt;</code>
</li>
<li>Copy the IP Address from the output under <code>NetworkSettings/IPAddress</code>
</li>
<li>In Emacs execute <code>M-x sql-mysql</code>
<ul class="org-ul">
<li>For <code>User:</code> enter the value for <code>&lt;user-name&gt;</code> (<code>root</code> is the default)</li>
<li>For <code>Password:</code> enter the value for <code>&lt;password&gt;</code>
</li>
<li>For <code>Database:</code> enter the value for <code>&lt;db-name&gt;</code>
</li>
<li>For <code>Server:</code> enter the IP Address from 2.</li>
</ul>
</li>
</ul>
<p>
That's it. Happy querying!
</p>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><p itemprop="keywords" class="tags">
            <span class="tag"><a class="p-category" href="../../categories/docker/" rel="tag">Docker</a></span>
            <span class="tag"><a class="p-category" href="../../categories/emacs/" rel="tag">Emacs</a></span>
            <span class="tag"><a class="p-category" href="../../categories/sql-mode/" rel="tag">sql-mode</a></span>
      </p>

            <div class="pager hidden-print pagination">

            <span class="previous pagination-item older">
                <a href="../editing-remote-files-over-ssh-with-emacs-and-tramp-mode/" rel="prev" title="Editing remote files over ssh with Emacs and Tramp mode">
                Previous post
                </a>
            </span>


            <span class="next pagination-item newer">
                <a href="../adding-disqus-comments-to-ghost-blog-on-azure/" rel="next" title="Adding Disqus comments to Ghost blog on Azure">
Next post
              </a>
            </span>

        </div>

    </nav></aside><section class="comments hidden-print"><h2>Comments</h2>
                    <div id="disqus_thread"></div>
        <script>
        var disqus_shortname ="rebeja",
            disqus_url="https://rebeja.eu/posts/use-emacs-sql-mode-to-connect-to-database-on-a-docker-image/",
        disqus_title="Use Emacs sql-mode to connect to database on a Docker image",
        disqus_identifier="cache/posts/use-emacs-sql-mode-to-connect-to-database-on-a-docker-image.html",
        disqus_config = function () {
            this.language = "en";
        };
        (function() {
            var dsq = document.createElement('script'); dsq.async = true;
            dsq.src = 'https://' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script><noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript" rel="nofollow">comments powered by Disqus.</a>
</noscript>
    <a href="https://disqus.com" class="dsq-brlink" rel="nofollow">Comments powered by <span class="logo-disqus">Disqus</span></a>


        </section></article><script>var disqus_shortname="rebeja";(function(){var a=document.createElement("script");a.async=true;a.src="https://"+disqus_shortname+".disqus.com/count.js";(document.getElementsByTagName("head")[0]||document.getElementsByTagName("body")[0]).appendChild(a)}());</script>
</div>
                <script src="../../assets/js/all-nocdn.js" type="text/javascript"></script><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element) {
            return element.getElementsByTagName('img')[0].alt;
    }});
    </script>
</body>
</html>
